# КОРТЕЖИ
# Перед вами кортеж words_tuple
#
# При помощи цикла for обойдите слова, хранящиеся в кортеже words_tuple,
# и для каждого элемента выведите строку вида
#
# Длина слова {word} = {len_word}

words_tuple = ('quaint', 'leftovers', 'thesis', 'density', 'retired', 'weak', 'tolerate',
               'sensitivity', 'primary', 'definition', 'determine', 'bring', 'monstrous',
               'hurl', 'timetable', 'month', 'advocate', 'provoke', 'stress', 'omission')

for item in words_tuple:
    i = len(item)
    print(f'Длина слова {item} = {i}')

# Допишите программу ниже,
# чтобы она вывела среднее арифметическое всех нечетных значений, хранящихся в кортеже my_tuple.

my_tuple = (-214, 181, -139, 448, -664, -66, 213, 832, 717, -462, -924, -706, -85, -244, -222, -340, -482, -518, -781, 759, -593, 905, -354, -377, -141, -742, 383, -381, 109, -639, -480, -810, -686, 892, -612, 696, 993, 791, 631, -493, -218, -829, -275, 619, -628, -241, -565, -835, -69, 747, 711, -252, -811, -407, -153, 904, 933, -254, 307, -493, -419, -109, -543, 155, -127, 613, -452, -459, 856, 562, 333, -66, -77, -598, -779, -278, 867, 321, -20, -415, -357, 735, -906, -14, -370, 453, -630, -736, -830, -917, 32, 422, -895, 198, 284, 472, -986, -964, -73, 29)


my_tuple = list(my_tuple)

odd_digit = [item for item in my_tuple if item % 2 != 0] #нечетные числа
sum_odd = sum(odd_digit) #сумма нечетных чисел
mean = sum_odd/len(odd_digit) #среднее арифметич нечетных чисел
print(mean)
